* performance-benchmark-framework
  :PROPERTIES:
  :header_args:bash: :session performance_benchmark_framework.sh :results none :exports code
  :END:

  FIXME: description

** TODO Use https://github.com/funcool/cats?

** Infrastructure
   https://docs.confluent.io/current/quickstart/ce-docker-quickstart.html
   https://www.terraform.io/docs/providers/aws/d/instance.html
   https://learn.hashicorp.com/terraform/getting-started/build.html
   https://sweetcode.io/deploying-aws-ec2-instance-using-terraform/

** CLI
   https://github.com/l3nz/cli-matic

** Benchmarking tools
   https://github.com/etcd-io/etcd/tree/master/tools/benchmark

** Usage

   FIXME: explanation

   $ java -jar performance-benchmark-framework-0.1.0-standalone.jar [args]

** Options

   FIXME: listing of options this app accepts.

** Commands

   #+begin_src bash
   docker-compose exec broker /usr/bin/kafka-producer-perf-test \
     --num-records 1000000 \
     --throughput 1000000 \
     --record-size 1000 \
     --topic performance_benchmark_framework \
     --producer-props bootstrap.servers=localhost:9092 batch.size=10 \
     --print-metrics
   #+end_src

   #+begin_src bash
   ./graalvm-ce-19.0.0/Contents/Home/bin/gu install native-image
   #+end_src

   #+begin_src bash
   ./graalvm-ce-19.0.0/Contents/Home/bin/native-image \
     -H:+ReportUnsupportedElementsAtRuntime \
     -J-Xmx3G \
     -J-Xms3G \
     --no-server \
     -jar target/uberjar/performance-benchmark-framework-0.1.0-SNAPSHOT-standalone.jar
   #+end_src

   #+RESULTS:
   | [performance-benchmark-framework-0.1.0-SNAPSHOT-standalone:30665] | classlist:  | 19,590.36   | ms     |       |         |
   | [performance-benchmark-framework-0.1.0-SNAPSHOT-standalone:30665] | (cap):      | 2,101.31    | ms     |       |         |
   | [performance-benchmark-framework-0.1.0-SNAPSHOT-standalone:30665] | setup:      | 3,808.44    | ms     |       |         |
   | [performance-benchmark-framework-0.1.0-SNAPSHOT-standalone:30665] | analysis:   | 36,806.07   | ms     |       |         |
   | Build                                                             | on          | Server(pid: | 31430, | port: | 64599)* |
   | [performance-benchmark-framework-0.1.0-SNAPSHOT-standalone:31430] | classlist:  | 5,089.69    | ms     |       |         |
   | [performance-benchmark-framework-0.1.0-SNAPSHOT-standalone:31430] | (cap):      | 1,279.61    | ms     |       |         |
   | [performance-benchmark-framework-0.1.0-SNAPSHOT-standalone:31430] | setup:      | 2,744.52    | ms     |       |         |
   | [performance-benchmark-framework-0.1.0-SNAPSHOT-standalone:31430] | (typeflow): | 2,259.01    | ms     |       |         |
   | [performance-benchmark-framework-0.1.0-SNAPSHOT-standalone:31430] | (objects):  | 813.92      | ms     |       |         |
   | [performance-benchmark-framework-0.1.0-SNAPSHOT-standalone:31430] | (features): | 182.39      | ms     |       |         |
   | [performance-benchmark-framework-0.1.0-SNAPSHOT-standalone:31430] | analysis:   | 3,342.72    | ms     |       |         |
   | [performance-benchmark-framework-0.1.0-SNAPSHOT-standalone:31430] | (clinit):   | 85.57       | ms     |       |         |
   | [performance-benchmark-framework-0.1.0-SNAPSHOT-standalone:31430] | universe:   | 275.78      | ms     |       |         |
   | [performance-benchmark-framework-0.1.0-SNAPSHOT-standalone:31430] | (parse):    | 264.96      | ms     |       |         |
   | [performance-benchmark-framework-0.1.0-SNAPSHOT-standalone:31430] | (inline):   | 1,090.04    | ms     |       |         |
   | [performance-benchmark-framework-0.1.0-SNAPSHOT-standalone:31430] | (compile):  | 4,024.48    | ms     |       |         |
   | [performance-benchmark-framework-0.1.0-SNAPSHOT-standalone:31430] | compile:    | 5,602.26    | ms     |       |         |
   | [performance-benchmark-framework-0.1.0-SNAPSHOT-standalone:31430] | image:      | 323.37      | ms     |       |         |
   | [performance-benchmark-framework-0.1.0-SNAPSHOT-standalone:31430] | write:      | 146.22      | ms     |       |         |
   | [performance-benchmark-framework-0.1.0-SNAPSHOT-standalone:31430] | [total]:    | 17,656.85   | ms     |       |         |

** License

   Copyright © 2019 FIXME

   This program and the accompanying materials are made available under the
   terms of the Eclipse Public License 2.0 which is available at
   http://www.eclipse.org/legal/epl-2.0.

   This Source Code may also be made available under the following Secondary
   Licenses when the conditions for such availability set forth in the Eclipse
   Public License, v. 2.0 are satisfied: GNU General Public License as published by
   the Free Software Foundation, either version 2 of the License, or (at your
   option) any later version, with the GNU Classpath Exception which is available
   at https://www.gnu.org/software/classpath/license.html.
